Revit 2027 API
BuiltInFailures.MEPFabricationFailures.PlaceCutinFittingFailed Property
 Failed to insert part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PlaceCutinFittingFailed { get; }
Public Shared ReadOnly Property PlaceCutinFittingFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PlaceCutinFittingFailed {
	FailureDefinitionId^ get ();
}
static member PlaceCutinFittingFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace